---
kind: other
id: AllMembers.T:Autodesk.Revit.Exceptions.ObjectAccessException
source: html/8c486481-595f-c787-6b40-88fde69df39b.htm
---
# ObjectAccessException Members

Retrieves data needed to serialize the target object.